"use client";

const About = () => {
  return (
    <div className="container py-12 sm:py-16 md:py-24">
      <div className="max-w-3xl mx-auto card text-center sm:text-left">
        <h1 className="text-2xl sm:text-3xl md:text-4xl font-bold  text-center sm:text-start text-black">
          درباره ما
        </h1>

        <p className="mt-4 sm:mt-5 leading-relaxed text-sm sm:text-base md:text-lg text-center sm:text-start text-black">
          ما یک اپلیکیشن جمع‌آوری کمک‌های مالی برای ایده‌های شما هستیم. پلتفرم
          ما به شما کمک می‌کند تا پروژه‌های خود را با جهان به اشتراک بگذارید، با
          حامیان خود ارتباط برقرار کنید و چشم‌انداز خود را توسعه دهید. با افراد
          و سازمان‌های همفکر همکاری کنید، به راحتی کمک‌های مالی را مدیریت کنید و
          پیشرفت خود را در لحظه پیگیری کنید. ما با هم، ایده‌های خلاقانه را به
          اقدامات تأثیرگذار تبدیل می‌کنیم.", پلتفرم ما با ارائه بستری حرفه‌ای و
          ایمن، امکان ثبت و مدیریت سفارش‌ها را به‌صورت یکپارچه فراهم می‌کند. با
          ثبت آسان سفارش، مشاهده وضعیت به‌صورت لحظه‌ای و بهره‌مندی از فرآیندهای
          شفاف و دقیق، تجربه‌ای مطمئن و کارآمد برای شما ایجاد می‌کنیم. هدف ما
          ارائه خدماتی پایدار، دقیق و مبتنی بر اعتماد است.
        </p>

        <p className="mt-3 leading-relaxed text-sm sm:text-base md:text-lg text-center sm:text-start text-black">
          پلتفرم ما با ارائه بستری حرفه‌ای و ایمن، امکان ثبت و مدیریت سفارش‌ها
          را به‌صورت یکپارچه فراهم می‌کند. با ثبت آسان سفارش، مشاهده وضعیت
          به‌صورت لحظه‌ای و بهره‌مندی از فرآیندهای شفاف و دقیق، تجربه‌ای مطمئن و
          کارآمد برای شما ایجاد می‌کنیم. هدف ما ارائه خدماتی پایدار، دقیق و
          مبتنی بر اعتماد است.
        </p>
      </div>
    </div>
  );
};

export default About;
